# pandas 

Pandas 基于两种数据类型，series 和 dataframe。

dataframe 是一个二维的、表格型的数据结构。

In [1]:
import pandas as pd

In [2]:
# use .read_csv() function of pandas to read csv file. 

csv_data = pd.read_csv('loans.csv')

In [3]:


# Getting first x rows.
csv_data.head(5)

,grade,sub_grade,short_emp,emp_length_num,home_ownership,dti,purpose,term,last_delinq_none,last_major_derog_none,revol_util,total_rec_late_fee,safe_loans
0,C,C4,1,1,RENT,1.00,car,60 months,1,1,9.4,0.0,-1
1,F,F2,0,5,OWN,5.55,small_business,60 months,1,1,32.6,0.0,-1
2,B,B5,1,1,RENT,18.08,other,60 months,1,1,36.5,0.0,-1
3,C,C1,1,1,RENT,10.08,debt_consolidation,36 months,1,1,91.7,0.0,-1
4,B,B2,0,4,RENT,7.06,other,36 months,1,1,55.5,0.0,-1

In [4]:

csv_data.tail(5)

,grade,sub_grade,short_emp,emp_length_num,home_ownership,dti,purpose,term,last_delinq_none,last_major_derog_none,revol_util,total_rec_late_fee,safe_loans
46503,C,C4,0,11,MORTGAGE,19.76,debt_consolidation,60 months,0,1,70.1,0.0,1
46504,C,C4,0,8,RENT,15.70,car,36 months,0,1,38.7,0.0,1
46505,D,D3,1,1,RENT,7.56,major_purchase,36 months,1,1,55.3,0.0,1
46506,E,E4,0,8,RENT,6.93,debt_consolidation,36 months,0,0,28.1,15.0,1
46507,A,A2,1,0,RENT,4.00,debt_consolidation,36 months,1,1,13.5,0.0,1

In [5]:
### 选取 colume

csv_data['grade'].head(5)

0    C
1    F
2    B
3    C
4    B
Name: grade, dtype: object

### 选取 row
根据index进行选取

In [6]:
csv_data[0:3]

,grade,sub_grade,short_emp,emp_length_num,home_ownership,dti,purpose,term,last_delinq_none,last_major_derog_none,revol_util,total_rec_late_fee,safe_loans
0,C,C4,1,1,RENT,1.00,car,60 months,1,1,9.4,0.0,-1
1,F,F2,0,5,OWN,5.55,small_business,60 months,1,1,32.6,0.0,-1
2,B,B5,1,1,RENT,18.08,other,60 months,1,1,36.5,0.0,-1

In [7]:
# 索引运算符" [ ] "  


csv_data[1:2]

,grade,sub_grade,short_emp,emp_length_num,home_ownership,dti,purpose,term,last_delinq_none,last_major_derog_none,revol_util,total_rec_late_fee,safe_loans
1,F,F2,0,5,OWN,5.55,small_business,60 months,1,1,32.6,0.0,-1

In [8]:

# 属性运算符 "."

### .loc( )

.loc() uses label based indexing to select both rows and columns. 

loc需要两个单/列表/范围运算符，用","分隔。第一个表示行，第二个表示列。


#### BluePrint

df.loc[:, 'A']

df.loc[:, ['A', 'C']]

In [9]:

csv_data.loc[:, ['grade','dti']].head()

  grade    dti
0     C   1.00
1     F   5.55
2     B  18.08
3     C  10.08
4     B   7.06

In [10]:
csv_data.loc[2, :]

grade                             B
sub_grade                        B5
short_emp                         1
emp_length_num                    1
home_ownership                 RENT
dti                           18.08
purpose                       other
term                      60 months
last_delinq_none                  1
last_major_derog_none             1
revol_util                     36.5
total_rec_late_fee                0
safe_loans                       -1
Name: 2, dtype: object

In [11]:
# 使用iloc函数选取第三行第三列的数据


csv_data.iloc[3,3]

1

In [12]:

# 使用iloc函数选取第3行到第5行与第3列到第5列的数据
csv_data.iloc[3:5,3:5]

   emp_length_num home_ownership
3               1           RENT
4               4           RENT

In [13]:

# 使用iloc函数选取1、2、5行与2、4、5列数据
csv_data.iloc[[0,2,5],[2,4,5]]

   short_emp home_ownership    dti
0          1           RENT   1.00
2          1           RENT  18.08
5          0           RENT  13.22

### .apply( )
对数据（行或列） Apply 函数

In [14]:
# BluePrint
# data.apply(function_name)


### create a dataFrame

In [15]:
import numpy as np
# create a series

date1 = pd.date_range("20190113",periods=3)


# create a dataFrame indexed by the series
df1 = pd.DataFrame(data=np.random.randint(3,5,size=(3,6)),index=date1,columns=list(["a","b","c","d","e","f"]))

print(df1)

            a  b  c  d  e  f
2019-01-13  4  4  4  3  4  3
2019-01-14  4  3  3  3  4  4
2019-01-15  4  3  3  3  4  4

### BluePrint .loc()

df.loc[row_indexer,column_indexer]